#+title: Setting up a Common Lisp environment
#+author: Anthony Le Cigne
#+options: num:nil

Setting up a Common Lisp environment is not easy for beginners. In
this note[fn:1], we will take a logical and progressive approach:

1. SBCL -> Common Lisp implementation.
2. Emacs + Sly -> Common Lisp IDE.
3. ASDF -> build system.
4. Quicklisp -> package manager.
5. Quickproject -> easy creation of Common Lisp projects as ASDF
   systems.
6. Buildapp -> easy compilation for your Lisp projects.
7. StumpWM -> full-blown Common Lisp window manager that will lispify
   your desktop experience.

You can already stop after step 2 and be productive in Lisp, or study
the many great [[https://github.com/alecigne/lisp-books][Lisp books]] out there.

* SBCL

I use [[http://www.sbcl.org/][SBCL]] as my Common Lisp implementation of choice. Source code and
binaries can be found [[http://www.sbcl.org/platform-table.html][here]].

I usually prefer to install the latest version instead of relying on
my distro's current version (although I use Debian Sid). Relevant
quote from [[https://github.com/stumpwm/stumpwm][StumpWM's GitHub page]] (a Common Lisp window manager that we
will install below):

#+begin_quote
Please do /not/ install SBCL using your distributions package manager,
especially Ubuntu. If you do so it is likely that you'll run into
problems when building StumpWM due to using obsolete versions of the
dependencies.
#+end_quote

As of [2026-03-08 Sun], we will download [[http://prdownloads.sourceforge.net/sbcl/sbcl-2.6.2-x86-64-linux-binary.tar.bz2][SBCL v2.6.2]]. I prefer to
install SBCL in =~/bin= and to create a symlink (=~/bin= is in my
PATH). From the directory in which you downloaded the tarball:

#+begin_src sh
  tar xavf sbcl-2.6.2-x86-64-linux-binary.tar.bz2
  cd sbcl-2.6.2-x86-64-linux
  mkdir ~/bin/sbcl-2.6.2
  INSTALL_ROOT=/home/alc/bin/sbcl-2.6.2 sh install.sh
  ln -s ~/bin/sbcl-2.6.2/bin/sbcl ~/bin/sbcl
#+end_src

Adapt this to your own needs, of course. Test the install:

#+name: sbcl-version
#+begin_src bash :results verbatim :exports both
  sbcl --version
#+end_src

#+RESULTS: sbcl-version
: SBCL 2.6.2

